CSI API ETABS v1

# cPropFrameGetColdHat Method

---

Retrieves frame section property data for a cold formed hat-type frame
section.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetColdHat(
    	string Name,
    	ref string FileName,
    	ref string MatProp,
    	ref double T3,
    	ref double T2,
    	ref double Thickness,
    	ref double Radius,
    	ref double LipDepth,
    	ref int Color,
    	ref string Notes,
    	ref string GUID
    )

    Function GetColdHat (
    	Name As String,
    	ByRef FileName As String,
    	ByRef MatProp As String,
    	ByRef T3 As Double,
    	ByRef T2 As Double,
    	ByRef Thickness As Double,
    	ByRef Radius As Double,
    	ByRef LipDepth As Double,
    	ByRef Color As Integer,
    	ByRef Notes As String,
    	ByRef GUID As String
    ) As Integer

    Dim instance As cPropFrame
    Dim Name As String
    Dim FileName As String
    Dim MatProp As String
    Dim T3 As Double
    Dim T2 As Double
    Dim Thickness As Double
    Dim Radius As Double
    Dim LipDepth As Double
    Dim Color As Integer
    Dim Notes As String
    Dim GUID As String
    Dim returnValue As Integer

    returnValue = instance.GetColdHat(Name,
    	FileName, MatProp, T3, T2, Thickness,
    	Radius, LipDepth, Color, Notes, GUID)

    int GetColdHat(
    	String^ Name,
    	String^% FileName,
    	String^% MatProp,
    	double% T3,
    	double% T2,
    	double% Thickness,
    	double% Radius,
    	double% LipDepth,
    	int% Color,
    	String^% Notes,
    	String^% GUID
    )

    abstract GetColdHat :
            Name : string *
            FileName : string byref *
            MatProp : string byref *
            T3 : float byref *
            T2 : float byref *
            Thickness : float byref *
            Radius : float byref *
            LipDepth : float byref *
            Color : int byref *
            Notes : string byref *
            GUID : string byref -> int

#### Parameters

Name

    Type: SystemString
The name of an existing cold formed hat-type frame section property.

FileName

    Type: SystemString
If the section property was imported from a property file, this is the name of
that file. If the section property was not imported, this item is blank.

MatProp

    Type: SystemString
The name of the material property for the section.

T3

    Type: SystemDouble

T2

    Type: SystemDouble

Thickness

    Type: SystemDouble
The section thickness. [L]

Radius

    Type: SystemDouble
The corner radius, if any. [L]

LipDepth

    Type: SystemDouble
The lip depth, if any. [L]

Color

    Type: SystemInt32

Notes

    Type: SystemString

GUID

    Type: SystemString
The GUID (global unique identifier), if any, assigned to the section.

#### Return Value

Type: Int32
returns zero if the section property data is successfully retrieved; otherwise
it returns a nonzero value.

Remarks

Please refer to [GetColdHat_1(String, String, String, Double, Double, Double,
Double, Double, Boolean, Int32, String, String)](39176e8e-d3ed-
aafd-4c99-16e2969bd63b.htm) which has additional parameters.

Examples

VB

Copy

     Public Sub Example()

        Dim SapModel As cSapModel
         Dim EtabsObject As cOAPI
        Dim ret As Integer = -1
        Dim Name As String
         Dim FileName As String
        Dim MatProp As String
        Dim t3 As Double
        Dim t2 As Double
        Dim Thickness As Double
        Dim LipDepth As Double
        Dim Radius As Double
        Dim Color As Integer
        Dim Notes As String
        Dim GUID As String   '''

        'create ETABS object
            Dim myHelper as cHelper = New Helper
            EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

        'start ETABS application
            ret = EtabsObject.ApplicationStart()

        'create SapModel object
            SapModel = EtabsObject.SapModel

        'initialize model
            ret = SapModel.InitializeNewModel()

        'create steel deck template model
            ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)

        'add cold formed material
            ret = SapModel.PropMaterial.AddQuick(Name, MATERIAL_COLDFORMED, , , , MATERIAL_COLDFORMED_SUBTYPE_ASTM_A653SQGr50)

        'set new frame section property
            ret = SapModel.PropFrame.SetColdHat("CH1", Name, 10, 3.2, 0.08, 0.3, 0.6)

        'get frame section property data
            ret = SapModel.PropFrame.GetColdHat("CH1", FileName, MatProp, t3, t2, Thickness, Radius, LipDepth, Color, Notes, GUID)

       close ETABS
          EtabsObject.ApplicationExit(False_
          SapModel = Nothing
          EtabsObject = Nothing
    End Sub

See Also

#### Reference

cPropFrame Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com